/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */

"about_button" = "About";
"upgrade_button" = "Upgrade";

//First Screen
"go_to_login" = "設定帳號";
"you_need_an_account" = "在您的裝置上找不到  $appname 的帳號.\n 請您先設定一組帳號，才能繼續使用。";

//Login Screen
"testing_connection" = "測試連線";
"server_instance_not_found" = "找不到伺服器";
"secure_connection_established" = "安全連線已建立";
"https_non_secure_connection_established" = "被轉向到一個非安全的連線";
"connection_established" = "連線已建立";
"login_details" = "登入細節";
"username" = "使用者名稱";
"password" = "密碼";
"login" = "登入";
"cancel" = "取消";
"error_login_message" = "帳號名稱或密碼不正確！";
"ok" = "確定";
"url_sample" = "伺服器位址 https://...";
"forbidden_characters_in_password" = "密碼含有禁止的字元符號";
"server" = "伺服器";
"url" = "URL";
"session_expired" = "憑證已經過期";
"credentials_different_user" = "輸入的使用者與這個帳戶的使用者不一致";
"auth_unsupported_auth_method" = "伺服器不支援這種認證方式";
"saml_server_does_not_give_user_id" = "伺服器並沒有傳回正確的使用者 ID, 請聯絡您的系統管理員\n	";
"authentification_not_valid" = "無法在這個伺服器上取得認證";
"error_too_many_http_redirects" = "建立連線時遇到一個錯誤，請再試一次。";
"retry" = "重試";
"help_link_login" = "新增到 $appname?";

//TabBarItems
"settings"="設定";
"files_tab"="檔案";

//Uploading
"upload" = "上傳";
"account" = "帳號:";
"location" = "地點：";
"photo_albums" = "相簿輯";
"loading" = "載入中…";
"no_access_to_gallery" = "這個應用程式 $appname 需要請開啟相簿及影像中心的存取權限，您也許可以在 設定 > 隱私 > 相簿 中找到開啟的選項。";
"error" = "錯誤";
"upload_failed"="上傳失敗";
"redirection_problem"="URL重新導向的功能不支援";

//First View
"menu_upload" = "上傳 照片/影片";
"menu_folder" = "新資料夾";
"menu_text_file" = "新文字檔";
"sort_menu_title" = "排序";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Newest-Oldest";

//Create/Edit File Text
"create_text_file" = "Create New Text File";
"title_view_new_text_file" = "New Text File";
"title_view_edit_text_file" = "Edit Text File";
"default_text_file_title" = "新文字檔";
"title_text_file_placeholder" = "Title...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "已經存在";
"error_file_name_empty" = "File name can not be empty.";
"no_changes_made" = "No changes have been made";
"no_file_downloaded" = "The file is not downloaded, you can not edit it";


//Create Folder
"create_folder" = "建立新資料夾";
"folder_name" = "輸入資料夾名稱:";
"save" = "儲存";
"folder_exist" = "您輸入的資料夾名稱已經存在，請您輸入其他名稱。";
"folder_create_error"="資料夾無法被建立";
"not_show_potrait"="選單目前不支援橫向視角，請改用縱向視角。";
"not_possible_create_folder" = "資料夾無法建立";

//FilesView
"confirm_to_delete_item" = "確認刪除此物件";
"yes" = "是";
"no" = "否";
"delete_from_device" = "您確定要從這個裝置上刪除這個檔案?";
"delete_from_server" = "您確定要從伺服器上刪除這個檔案?";
"not_possible_connect_to_server" = "目前無法連線到伺服器。";
"delete_folder_from_server" = "您確定要從伺服器上刪除這個資料夾?";
"delete_local_server" = "從伺服器以及裝置上刪除";
"delete_local" = "從裝置上刪除";
"delete_server" = "從伺服器上刪除";
"error_path" = "無法開啟這個資料夾，請您確定資料夾存在";
"error_not_permission" = "您沒有權限進行這項操作。";
"folders" = "資料夾";
"files" = "檔案";
"folder" = "資料夾";
"file" = "檔案";
"more_swipe" = "更多";
"message_not_files" = "這裡還沒有東西，上傳一些吧！";

//Refresh file list
"release_refresh"="鬆開即可更新...";
"loading_refresh"="載入中…";
"pull_down_refresh"="向下滑動來重新整理";

//Miscelanea
"back" = "返回";

//Preview
"open_with_label" = "開啟方式";
"delete_label"= "刪除";

//Open with
"file_cannot_be_opened" = "檔案無法被開啟";
"no_app_instaled_to_open_it" = "目前沒有安裝可開啟這類型檔案的應用程式。";

//WTClient messages (Download/Upload)
"establishing_connection" = "建立連線中";
"not_establishing_connection" = "無法建立連線";
"connection_closed" = "連線已關閉";
"connection_lost" = "已斷線";
"auth_failed" = "認證失敗";
"auth_passed" = "認証通過";
"request_file_not_found" = "要求的檔案不存在伺服器上";
"request_file_not_accesed" = "無存存取要求的檔案";
"unknow_response_server" = "錯誤: 從伺服器回傳了非預期的回應";
"uploading_data" = "上傳資料中";
"downloading_data" = "下載資料中";
"transfer_complete" = "傳輸完成";
"transfer_failed" = "傳輸失敗";

//Settings and PinCode
"title_app_pin" = "密碼鎖";
"title_app_pin_and_touchID" = "Passcode & Touch ID";
"enter_app_pin" = "輸入密碼鎖";
"enter_app_pin_long_description" = "輸入密碼鎖";
"reenter_app_pin" = "再次輸入密碼鎖";
"remove_app_pin" = "移除您的密碼鎖密碼";
"both_pass_not_same" = "輸入的密碼鎖不一致";
"app_pin_incorrect" = "密碼鎖不正確";
"passcode_not_enabled" = "Enable passcode first";
"title_app_touchID" = "Touch ID";
"disconnect_button" = "已從伺服器斷線";
"pin_removed" = "密碼鎖已被移除";
"incorrect_pin" = "不正確的密碼";
"app_pin_stored" = "密碼鎖已設定";
"help" = "說明";
"recommend_to_friend" = "推薦給朋友";
"send_feedback" = "發送回饋意見";
"manage_accounts" = "管理帳號";
"add_new_account" = "新增帳號";
"save_changes" = "儲存";
"add_account" = "增加";
"user_exist" = "輸入的使用者已經存在";
"imprint_button" = "版本說明";
"title_instant_upload_photos"="Instant Upload Photos";
"title_instant_upload_videos"="Instant Upload Videos";
"title_background_instant_upload" = "Background Instant Upload";
"accounts_section" = "帳號";
"security_section" = "安全性";
"instant_updloads_section" = "即時上傳";
"more_section" = "更多";
"unlock_app" = "Unlock $appname";

//Downloading
"can_no_copy_to_gallery" = "檔案無法被複製到相簿，因為這個檔案無法使用相簿開啟";
"file_is_downloading" = "這個檔案已經下載中";
"download_file_exist" = "無法開啟這個檔案，請您確定檔案存在";
"wait_to_download" = "正在準備下載";
"updating" = "更新中";
"msg_while_downloads" = "目前無法進行這個操作，請您等待目前的下載完成再進行操作";

//SSL
"invalid_ssl_cert" = "這個網站的憑證無法被驗證，您確定要相信這個驗證？";
"connection_declined" = "使用者中斷連線";

//Recent view
"recent_now"="幾秒前";
"recent_minutes"="$minutes 分鐘前";
"recent_minute"="$minutes 分鐘前";
"recent_hours"="$hours 小時前";
"recent_hour"="$hours 小時前";
"recent_days"="$days 天前";
"recent_day"="$days 天前";
"recent_months"="$months 個月前";
"recent_month"="$months 個月前";

"uploads_tab"="上傳";
"current_section"="目前";
"uploader_section"="已上傳";
"nothing_was_upload_recently"="近期沒有從這個裝置上傳的東西";
"failed_uploader_section"="上傳失敗";
"clear_successful"="清除成功";
"error_credential"="認證錯誤";
"error_destiny_does_not_exist"="資夾錯誤";
"error_file_exists"="衝突錯誤";
"error_permission" = "權限錯誤";
"error_file_does_not_exist" = "Not available on the device";
"error_file_in_background" = "伺服器錯誤";
"error_file_invalid_characters" = "無效的字元";
"change_active_user"="將目前正在使用的帳號更換為";
"waiting_for_server"="等待伺服器連線";
"waiting_for_upload"="上傳等候中";
"error_permission_alert_message" = "您沒有權限上傳這個資料夾";
"choose_folder" = "選擇資料夾";

//Select Folder View
"upload_label"="上傳到";
"create_button"="建立";
"choose_button"="選擇";

//Rename
"rename_long_press" = "重新命名";
"rename_file_title" = "重新命名";
"enter_new_name" = "輸入新名稱";
"rename_file_exist" = "您輸入的名稱已經存在，請您輸入其他名稱。";

//Move
"move_long_press" = "移動";
"move_to_label" = "搬移到";
"file_exist" = "這個檔案已經存在於目的目錄中";
"override_file" = "您要用新的檔案取代目前已存在的檔案？";
"accept" = "接受";
"error_folder_destiny_is_the_same" = "錯誤: 無法將資料夾搬移到自己資料夾內部";
"original_file_exist" = "無法移動該檔案，請確定檔案存在";
"original_folder_exist" = "無法移動該資料夾，請確定資料夾存在";

//Download folfer
"download_folder" = "下載資料夾";
"cancel_download" = "取消下載";

//Upload from other apps
"other_apps_title" = "目的地";
"other_apps_account" = "帳號";
"other_apps_folder" = "資料夾";
"other_apps_file_name" = "檔案名稱";
"other_apps_send_to" = "上傳到";
"error_moving_file" = "無法移動該檔案，請確定目的地資料夾存在";
"forbidden_characters_from_server" = "名稱含有不合法的字元";
"overwritte_title" = "覆寫";

//Social
"twitter_message" = "在您的手機中試用 $twitteruser";
"facebook_message" = "在您的手機中試用$appname!\n";
"mail_recommendation_subject" = "在您的手機中試用$appname!";
"mail_recommendation_body" = "我想邀請您在您的手機上使用 $appname ! \n可以由這兒下載: ";
"device_not_support_mail" = "Please, configure your mail account";
"mail_feedback_subject" = "回饋意見給 $appname";
"account_not_configure" = "您的裝置目前沒有設定好的帳號，請到設定頁面設定。";

//Storage
"of_storage" = "的";
"occupied_storage" = "占用";
"storage" = "儲存區";
"storage_upgrade" = "更新儲存裝置";

//Jimmies
"this_file_is_older" = "有新版本";
"msg_update_file_0_bytes" = "這個檔案在伺服器上大小是0，您確定要將這個空檔案覆寫掉您裝置上現有的檔案?";

//Shared
"shared_tab" = "分享連結";
"message_not_shared_files" = " 目前沒有透過連結分享任何資訊";
"message_not_shared_api_support" = "很抱歉, 您的伺服器並未開啟分享的功能. 請聯絡您的伺服器管理員";
"share_link_long_press" = "分享";
"unshare_link" = "取消共享連結";
"share_not_available_on_this_server" = "很抱歉, 您的伺服器並未開啟這個功能. 請聯絡您的伺服器管理員";
"copy_link" = "複製連結";
"file_to_share_not_exist" = "無法分享這個檔案或目錄. 請檢查它們是否存在";
"file_to_unshare_not_exist" = "無法取消分享這個檔案或目錄. 請檢查它們是否存在";
"shared_link_protected_title" = "輸入密碼";
"shared_link_protected_message" = "分享此連結您必須輸入密碼來防護";
"pasword_empty" = "密碼不能為空白";
"no_pasword" = "您必須輸入密碼";
"get_share_link" = "取得分享連結";
"set_expiration_time" = "設置到期日";
"password_protect" = "密碼保護";
"allow_editing" = "允許編輯";
"default_not_possible_msg" = "目前無法進行這個操作，請您稍候再試";
"share_user_group_indicator" = "群組";
"share_user_federated_indicator" = "遠端";
"add_user_or_group_title" = "新增使用者或是群組";
"share_with_users_or_groups" = "與用戶或群組分享";
"not_share_with_users_yet"= "Not shared with any users yet";
"not_sharee_api_supported" = "Sorry, your server version does not allow share with users. Please contact your administrator";
"share_link_title" = "分享連結";
"not_share_link_enabled_capabilities" = "這台伺服器並未開啟分享的功能，請聯絡您的伺服器管理員";
"shared_link_cannot_remove_password" = "無法移除密碼";
"shared_link_cannot_remove_expiration_date" = "到期日期不能空白，必須設定到期日才才能分享";
"shared_link_mail_subject" = "$userName shared »$fileOrFolderName« with you";
"secured_link" = "安全";

//Shared privileges
"title_user_can_edit" = "Can edit";
"title_user_can_share" = "Can share";
"user_can_create" = "建立";
"user_can_change" = "更動";
"user_can_delete" = "刪除";
"title_view_edit_user_privileges" = "Privileges";

//Favorites
"favorite" = "我的最愛";
"unfavorite" = "不喜愛的";
"parent_folder_is_favorite" = "有資料夾包含此檔案並已經設為最愛";

//Available offline
"available_offline" = "Available offline";
"not_available_offline" = "Not available offline";
"parent_folder_is_available_offline_file_child" = "A folder that contains this file is already available offline";
"parent_folder_is_available_offline_folder_child" = "A folder that contains this folder is already available offline";

//Document provider
"error_login_doc_provider" = "Unable to access your account. Please use the $appname app to sign in first.";
"error_sending_file_to_document_picker" = "傳送檔案至文件選擇器時發生錯誤";
"error_user_change_in_core_app" = "使用者已經在 $appname 應用程式被變更";
"error_connecting_with_server" = "目前無法連線到伺服器，請稍候再式";
"move_doc_provider_button" = "移動到這個位置";
"export_doc_provider_button" = "匯出到這個位置";

//Instant uploads
"location_not_enabled"="定位服務尚未啟用";
"message_location_not_enabled"="Please go to Settings and turn on Location Services to enable instant photo uploads in the background.";

"access_photos_library_not_enabled" = "存取相簿功能未啟用";
"message_access_photos_not_enabled" = "若要使用即時上傳相片功能，請至設定開啟相簿存取";

//PDF reader
"page_of_pages" = "的"; //Example: 5 of 10

//Share in
"files_added" = "檔案已新增";
"files_will_be_upload_next_time" = "The files will start to upload the next time that you open $appname";

//Help Guide main app
"title_help_slide_0" = "Welcome to $appname!";
"message_help_slide_0" = "滑動以了解更多";
"title_help_slide_1" = "即時上傳";
"message_help_slide_1" = "隨時確保您的相片是安全的";
"title_help_slide_2" = "管理您所有的檔案";
"message_help_slide_2" = "您可以刪除，移動";
"title_help_slide_3" = "分享";
"message_help_slide_3" = "您可以分享檔案和資料夾";
"title_help_slide_4" = "多重使用者";
"message_help_slide_4" = "連線到您所有的雲端服務";
"title_help_slide_5" = "您可以從任何地方同步您的私人檔案";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "登入";
"skip_button_help_guide" = "略過";

//Account menu
"menu_account_edit" = "Edit Password";
"menu_account_clear_cache" = "清除快取";
"menu_account_log_out" = "刪除帳號";
